tutorials/single_phase_elastic/scalarTransportPillars/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;

scaleFactor 1e-5;

// Geometry definition
geometry
{
    //two_cylinders.stl
    //three_cylinders.stl
    ManyCylinders.stl
    {
        type triSurfaceMesh;
        name geometry;
        scale $scaleFactor;  // Scale factor (e.g., mm to m conversion)
    }
}

// Settings for the castellated mesh generation
castellatedMeshControls
{
    // Refinement parameters
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    // Explicit feature edge refinement
    features
    (
    );

    // Surface based refinement
    refinementSurfaces
    {
        geometry
        {
            level (1 2);  // min and max refinement levels
            
            // Patch info
            patchInfo
            {
                type wall;
            }
        }
    }

    // Resolve sharp angles
    resolveFeatureAngle 60;

    // Region-wise refinement
    refinementRegions
    {
    }

    locx0 1e-4;
    locy0 1e-4;
    locz0 1e-4;

    locx    #calc "$locx0*$scaleFactor";
    locy    #calc "$locy0*$scaleFactor";
    locz    #calc "$locz0*$scaleFactor";

    // Mesh selection
    locationInMesh ($locx $locy $locz);  // Point inside the mesh domain
    allowFreeStandingZoneFaces true;

    // Prevent refinement in z-direction
    useTopologyChange true;
}

// Settings for the snapping
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

// Settings for the layer addition (disabled)
addLayersControls
{
    relativeSizes true;
    layers
    {
    }
    
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

// Generic mesh quality settings
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-9;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    
    // Advanced
    nSmoothScale 4;
    errorReduction 0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}

// Advanced
debug 0;
mergeTolerance 1e-8;

// ************************************************************************* //